# 读取数据

In [4]:
import sys

sys.executable

'/root/first_env/bin/python'

In [5]:
import os

os.listdir()

['.ipynb_checkpoints',
 '1. Titanic数据预处理.ipynb',
 'gender_submission.csv',
 'train.csv',
 '.git',
 'test.csv',
 'README.md']

In [7]:
import pandas as pd

In [66]:
train = pd.read_csv('train.csv')

In [8]:
test = pd.read_csv('test.csv')

# 分析数据

In [9]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
train.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [78]:
train1 = train.copy()

## 删除并填补缺失值

In [79]:
train1['Age'].fillna(train['Age'].median(), inplace=True)

In [80]:
train1['Age'].isnull().any()

False

In [81]:
train1['Embarked'].fillna(train['Embarked'].mode()[0], inplace=True)

In [82]:
drop_colums = ['PassengerId', 'Cabin', 'Ticket']

In [83]:
train1.drop(drop_colums, axis='columns', inplace=True)

In [84]:
train1.head(5)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,7.2500,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,71.2833,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,7.9250,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,53.1000,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,8.0500,S

## 创建新的特征

从名字中提取特征

In [85]:
import re
r = re.compile(', (\w+).')
train1['Name'] = train1['Name'].apply(lambda x: r.findall(x)[0])

In [86]:
train1.head()

   Survived  Pclass  Name     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    Mr    male  22.0      1      0   7.2500        S
1         1       1   Mrs  female  38.0      1      0  71.2833        C
2         1       3  Miss  female  26.0      0      0   7.9250        S
3         1       1   Mrs  female  35.0      1      0  53.1000        S
4         0       3    Mr    male  35.0      0      0   8.0500        S

In [89]:
d = dict(train1['Name'].value_counts() < 10)

In [90]:
d

{'Mr': False,
 'Miss': False,
 'Mrs': False,
 'Master': False,
 'Dr': True,
 'Rev': True,
 'Col': True,
 'Mlle': True,
 'Major': True,
 'Capt': True,
 'Ms': True,
 'Mme': True,
 'Don': True,
 'the': True,
 'Sir': True,
 'Jonkheer': True,
 'Lady': True}

In [92]:
min_num = 10
train1['Name'] = train1['Name'].apply(lambda x: 'Misc' if d[x] else x)
# labmda x 后面是返回的对象，每次传x进去，返回对象

In [94]:
train1['Name'].value_counts()

Mr        517
Miss      182
Mrs       125
Master     40
Misc       27
Name: Name, dtype: int64

In [95]:
train1.head()

   Survived  Pclass  Name     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    Mr    male  22.0      1      0   7.2500        S
1         1       1   Mrs  female  38.0      1      0  71.2833        C
2         1       3  Miss  female  26.0      0      0   7.9250        S
3         1       1   Mrs  female  35.0      1      0  53.1000        S
4         0       3    Mr    male  35.0      0      0   8.0500        S

创建特征，家庭成员大小，和是否独自一人

In [96]:
train1['Family_size'] = train1['SibSp'] + train1['Parch']

In [97]:
train1['Family_size'].value_counts()

0     537
1     161
2     102
3      29
5      22
4      15
6      12
10      7
7       6
Name: Family_size, dtype: int64

In [98]:
train1['IsAlone'] = train1['Family_size'].apply(lambda x: False if x else True)

In [99]:
train1['IsAlone'].value_counts()

True     537
False    354
Name: IsAlone, dtype: int64

In [100]:
train1.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Family_size,IsAlone
0,0,3,Mr,male,22.0,1,0,7.2500,S,1,False
1,1,1,Mrs,female,38.0,1,0,71.2833,C,1,False
2,1,3,Miss,female,26.0,0,0,7.9250,S,0,True
3,1,1,Mrs,female,35.0,1,0,53.1000,S,1,False
4,0,3,Mr,male,35.0,0,0,8.0500,S,0,True

将Age和Fare进行分类，区间分类

加astype和不加有什么区别吗

In [106]:
# train1['Age']
pd.cut(train1['Age'].astype(int), 5).dtypes

CategoricalDtype(categories=[(-0.08, 16.0], (16.0, 32.0], (32.0, 48.0], (48.0, 64.0], (64.0, 80.0]],
              ordered=True)

In [115]:
pd.cut(train1['Age'].astype(int), 5)

0      (16.0, 32.0]
1      (32.0, 48.0]
2      (16.0, 32.0]
3      (32.0, 48.0]
4      (32.0, 48.0]
           ...
886    (16.0, 32.0]
887    (16.0, 32.0]
888    (16.0, 32.0]
889    (16.0, 32.0]
890    (16.0, 32.0]
Name: Age, Length: 891, dtype: category
Categories (5, interval[float64]): [(-0.08, 16.0] < (16.0, 32.0] < (32.0, 48.0] < (48.0, 64.0] < (64.0, 80.0]]

In [116]:
pd.cut(train1['Age'], 5)

0      (16.336, 32.252]
1      (32.252, 48.168]
2      (16.336, 32.252]
3      (32.252, 48.168]
4      (32.252, 48.168]
             ...
886    (16.336, 32.252]
887    (16.336, 32.252]
888    (16.336, 32.252]
889    (16.336, 32.252]
890    (16.336, 32.252]
Name: Age, Length: 891, dtype: category
Categories (5, interval[float64]): [(0.34, 16.336] < (16.336, 32.252] < (32.252, 48.168] < (48.168, 64.084] < (64.084, 80.0]]

In [118]:
train1['New_age'] = pd.cut(train1['Age'].astype(int), 5)

In [119]:
train1.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Family_size,IsAlone,New_age
0,0,3,Mr,male,22.0,1,0,7.2500,S,1,False,"(16.0, 32.0]"
1,1,1,Mrs,female,38.0,1,0,71.2833,C,1,False,"(32.0, 48.0]"
2,1,3,Miss,female,26.0,0,0,7.9250,S,0,True,"(16.0, 32.0]"
3,1,1,Mrs,female,35.0,1,0,53.1000,S,1,False,"(32.0, 48.0]"
4,0,3,Mr,male,35.0,0,0,8.0500,S,0,True,"(32.0, 48.0]"

对fare进行分区间

In [121]:
train1['New_Fare'] = pd.qcut(train1['Fare'], 4)

In [122]:
train1.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked,Family_size,IsAlone,New_age,New_Fare
0,0,3,Mr,male,22.0,1,0,7.2500,S,1,False,"(16.0, 32.0]","(-0.001, 7.91]"
1,1,1,Mrs,female,38.0,1,0,71.2833,C,1,False,"(32.0, 48.0]","(31.0, 512.329]"
2,1,3,Miss,female,26.0,0,0,7.9250,S,0,True,"(16.0, 32.0]","(7.91, 14.454]"
3,1,1,Mrs,female,35.0,1,0,53.1000,S,1,False,"(32.0, 48.0]","(31.0, 512.329]"
4,0,3,Mr,male,35.0,0,0,8.0500,S,0,True,"(32.0, 48.0]","(7.91, 14.454]"

## 开始编码

使用one hot编码

In [125]:
train1 = pd.get_dummies(train1, columns=['Name', 'Sex', 'Embarked'], prefix=['Name', 'Sex', 'Embarked'])

In [126]:
train1.head(5)

,Survived,Pclass,Age,SibSp,Parch,Fare,Family_size,IsAlone,New_age,New_Fare,Name_Master,Name_Misc,Name_Miss,Name_Mr,Name_Mrs,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,0,3,22.0,1,0,7.2500,1,False,"(16.0, 32.0]","(-0.001, 7.91]",0,0,0,1,0,0,1,0,0,1
1,1,1,38.0,1,0,71.2833,1,False,"(32.0, 48.0]","(31.0, 512.329]",0,0,0,0,1,1,0,1,0,0
2,1,3,26.0,0,0,7.9250,0,True,"(16.0, 32.0]","(7.91, 14.454]",0,0,1,0,0,1,0,0,0,1
3,1,1,35.0,1,0,53.1000,1,False,"(32.0, 48.0]","(31.0, 512.329]",0,0,0,0,1,1,0,0,0,1
4,0,3,35.0,0,0,8.0500,0,True,"(32.0, 48.0]","(7.91, 14.454]",0,0,0,1,0,0,1,0,0,1